WuVictorQ3/app/controllers/movies_controller.rb

SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date
---
  def index
    @all_ratings = Movie.uniq.pluck(:rating)
    @category = params[:category]
    @ratings = params[:ratings].nil? ? session[:ratings].nil? ? @all_ratings : session[:ratings] : params[:ratings].keys
    @movies = @category.nil? ? Movie.where({ rating: @ratings}) : Movie.where({ rating: @ratings }).order(@category)